espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/iomux_mspi_pin_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** IOMUX_MSPI_PIN_CLK_EN0_REG register
 *  apb registers auto clock gating reg
 */
#define IOMUX_MSPI_PIN_CLK_EN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x0)
/** IOMUX_MSPI_PIN_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  1: auto clock gating on
 *  0: auto clock gating off
 */
#define IOMUX_MSPI_PIN_REG_CLK_EN    (BIT(0))
#define IOMUX_MSPI_PIN_REG_CLK_EN_M  (IOMUX_MSPI_PIN_REG_CLK_EN_V << IOMUX_MSPI_PIN_REG_CLK_EN_S)
#define IOMUX_MSPI_PIN_REG_CLK_EN_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_CLK_EN_S  0

/** IOMUX_MSPI_PIN_FLASH_CS_PIN0_REG register
 *  IOMUX_MSPI_PIN_FLASH_CS_PIN0_REG
 */
#define IOMUX_MSPI_PIN_FLASH_CS_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x4)
/** IOMUX_MSPI_PIN_REG_FLASH_CS_HYS : R/W; bitpos: [0]; default: 0;
 *  flash cs hys
 */
#define IOMUX_MSPI_PIN_REG_FLASH_CS_HYS    (BIT(0))
#define IOMUX_MSPI_PIN_REG_FLASH_CS_HYS_M  (IOMUX_MSPI_PIN_REG_FLASH_CS_HYS_V << IOMUX_MSPI_PIN_REG_FLASH_CS_HYS_S)
#define IOMUX_MSPI_PIN_REG_FLASH_CS_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_CS_HYS_S  0
/** IOMUX_MSPI_PIN_REG_FLASH_CS_IE : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_FLASH_CS_IE    (BIT(1))
#define IOMUX_MSPI_PIN_REG_FLASH_CS_IE_M  (IOMUX_MSPI_PIN_REG_FLASH_CS_IE_V << IOMUX_MSPI_PIN_REG_FLASH_CS_IE_S)
#define IOMUX_MSPI_PIN_REG_FLASH_CS_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_CS_IE_S  1
/** IOMUX_MSPI_PIN_REG_FLASH_CS_WPU : R/W; bitpos: [2]; default: 0;
 *  flash cs wpu
 */
#define IOMUX_MSPI_PIN_REG_FLASH_CS_WPU    (BIT(2))
#define IOMUX_MSPI_PIN_REG_FLASH_CS_WPU_M  (IOMUX_MSPI_PIN_REG_FLASH_CS_WPU_V << IOMUX_MSPI_PIN_REG_FLASH_CS_WPU_S)
#define IOMUX_MSPI_PIN_REG_FLASH_CS_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_CS_WPU_S  2
/** IOMUX_MSPI_PIN_REG_FLASH_CS_WPD : R/W; bitpos: [3]; default: 0;
 *  flash cs wpd
 */
#define IOMUX_MSPI_PIN_REG_FLASH_CS_WPD    (BIT(3))
#define IOMUX_MSPI_PIN_REG_FLASH_CS_WPD_M  (IOMUX_MSPI_PIN_REG_FLASH_CS_WPD_V << IOMUX_MSPI_PIN_REG_FLASH_CS_WPD_S)
#define IOMUX_MSPI_PIN_REG_FLASH_CS_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_CS_WPD_S  3
/** IOMUX_MSPI_PIN_REG_FLASH_CS_DRV : R/W; bitpos: [5:4]; default: 0;
 *  flash cs drv
 */
#define IOMUX_MSPI_PIN_REG_FLASH_CS_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_FLASH_CS_DRV_M  (IOMUX_MSPI_PIN_REG_FLASH_CS_DRV_V << IOMUX_MSPI_PIN_REG_FLASH_CS_DRV_S)
#define IOMUX_MSPI_PIN_REG_FLASH_CS_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_FLASH_CS_DRV_S  4

/** IOMUX_MSPI_PIN_FLASH_Q_PIN0_REG register
 *  IOMUX_MSPI_PIN_FLASH_Q_PIN0_REG
 */
#define IOMUX_MSPI_PIN_FLASH_Q_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x8)
/** IOMUX_MSPI_PIN_REG_FLASH_Q_HYS : R/W; bitpos: [0]; default: 0;
 *  flash q hys
 */
#define IOMUX_MSPI_PIN_REG_FLASH_Q_HYS    (BIT(0))
#define IOMUX_MSPI_PIN_REG_FLASH_Q_HYS_M  (IOMUX_MSPI_PIN_REG_FLASH_Q_HYS_V << IOMUX_MSPI_PIN_REG_FLASH_Q_HYS_S)
#define IOMUX_MSPI_PIN_REG_FLASH_Q_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_Q_HYS_S  0
/** IOMUX_MSPI_PIN_REG_FLASH_Q_IE : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_FLASH_Q_IE    (BIT(1))
#define IOMUX_MSPI_PIN_REG_FLASH_Q_IE_M  (IOMUX_MSPI_PIN_REG_FLASH_Q_IE_V << IOMUX_MSPI_PIN_REG_FLASH_Q_IE_S)
#define IOMUX_MSPI_PIN_REG_FLASH_Q_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_Q_IE_S  1
/** IOMUX_MSPI_PIN_REG_FLASH_Q_WPU : R/W; bitpos: [2]; default: 0;
 *  flash q wpu
 */
#define IOMUX_MSPI_PIN_REG_FLASH_Q_WPU    (BIT(2))
#define IOMUX_MSPI_PIN_REG_FLASH_Q_WPU_M  (IOMUX_MSPI_PIN_REG_FLASH_Q_WPU_V << IOMUX_MSPI_PIN_REG_FLASH_Q_WPU_S)
#define IOMUX_MSPI_PIN_REG_FLASH_Q_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_Q_WPU_S  2
/** IOMUX_MSPI_PIN_REG_FLASH_Q_WPD : R/W; bitpos: [3]; default: 0;
 *  flash q wpd
 */
#define IOMUX_MSPI_PIN_REG_FLASH_Q_WPD    (BIT(3))
#define IOMUX_MSPI_PIN_REG_FLASH_Q_WPD_M  (IOMUX_MSPI_PIN_REG_FLASH_Q_WPD_V << IOMUX_MSPI_PIN_REG_FLASH_Q_WPD_S)
#define IOMUX_MSPI_PIN_REG_FLASH_Q_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_Q_WPD_S  3
/** IOMUX_MSPI_PIN_REG_FLASH_Q_DRV : R/W; bitpos: [5:4]; default: 0;
 *  flash q drv
 */
#define IOMUX_MSPI_PIN_REG_FLASH_Q_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_FLASH_Q_DRV_M  (IOMUX_MSPI_PIN_REG_FLASH_Q_DRV_V << IOMUX_MSPI_PIN_REG_FLASH_Q_DRV_S)
#define IOMUX_MSPI_PIN_REG_FLASH_Q_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_FLASH_Q_DRV_S  4

/** IOMUX_MSPI_PIN_FLASH_WP_PIN0_REG register
 *  IOMUX_MSPI_PIN_FLASH_WP_PIN0_REG
 */
#define IOMUX_MSPI_PIN_FLASH_WP_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0xc)
/** IOMUX_MSPI_PIN_REG_FLASH_WP_HYS : R/W; bitpos: [0]; default: 0;
 *  flash wp hys
 */
#define IOMUX_MSPI_PIN_REG_FLASH_WP_HYS    (BIT(0))
#define IOMUX_MSPI_PIN_REG_FLASH_WP_HYS_M  (IOMUX_MSPI_PIN_REG_FLASH_WP_HYS_V << IOMUX_MSPI_PIN_REG_FLASH_WP_HYS_S)
#define IOMUX_MSPI_PIN_REG_FLASH_WP_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_WP_HYS_S  0
/** IOMUX_MSPI_PIN_REG_FLASH_WP_IE : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_FLASH_WP_IE    (BIT(1))
#define IOMUX_MSPI_PIN_REG_FLASH_WP_IE_M  (IOMUX_MSPI_PIN_REG_FLASH_WP_IE_V << IOMUX_MSPI_PIN_REG_FLASH_WP_IE_S)
#define IOMUX_MSPI_PIN_REG_FLASH_WP_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_WP_IE_S  1
/** IOMUX_MSPI_PIN_REG_FLASH_WP_WPU : R/W; bitpos: [2]; default: 0;
 *  flash wp wpu
 */
#define IOMUX_MSPI_PIN_REG_FLASH_WP_WPU    (BIT(2))
#define IOMUX_MSPI_PIN_REG_FLASH_WP_WPU_M  (IOMUX_MSPI_PIN_REG_FLASH_WP_WPU_V << IOMUX_MSPI_PIN_REG_FLASH_WP_WPU_S)
#define IOMUX_MSPI_PIN_REG_FLASH_WP_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_WP_WPU_S  2
/** IOMUX_MSPI_PIN_REG_FLASH_WP_WPD : R/W; bitpos: [3]; default: 0;
 *  flash wp wpd
 */
#define IOMUX_MSPI_PIN_REG_FLASH_WP_WPD    (BIT(3))
#define IOMUX_MSPI_PIN_REG_FLASH_WP_WPD_M  (IOMUX_MSPI_PIN_REG_FLASH_WP_WPD_V << IOMUX_MSPI_PIN_REG_FLASH_WP_WPD_S)
#define IOMUX_MSPI_PIN_REG_FLASH_WP_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_WP_WPD_S  3
/** IOMUX_MSPI_PIN_REG_FLASH_WP_DRV : R/W; bitpos: [5:4]; default: 0;
 *  flash wp drv
 */
#define IOMUX_MSPI_PIN_REG_FLASH_WP_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_FLASH_WP_DRV_M  (IOMUX_MSPI_PIN_REG_FLASH_WP_DRV_V << IOMUX_MSPI_PIN_REG_FLASH_WP_DRV_S)
#define IOMUX_MSPI_PIN_REG_FLASH_WP_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_FLASH_WP_DRV_S  4

/** IOMUX_MSPI_PIN_FLASH_HOLD_PIN0_REG register
 *  IOMUX_MSPI_PIN_FLASH_HOLD_PIN0_REG
 */
#define IOMUX_MSPI_PIN_FLASH_HOLD_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x10)
/** IOMUX_MSPI_PIN_REG_FLASH_HOLD_HYS : R/W; bitpos: [0]; default: 0;
 *  flash hold hys
 */
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_HYS    (BIT(0))
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_HYS_M  (IOMUX_MSPI_PIN_REG_FLASH_HOLD_HYS_V << IOMUX_MSPI_PIN_REG_FLASH_HOLD_HYS_S)
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_HYS_S  0
/** IOMUX_MSPI_PIN_REG_FLASH_HOLD_IE : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_IE    (BIT(1))
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_IE_M  (IOMUX_MSPI_PIN_REG_FLASH_HOLD_IE_V << IOMUX_MSPI_PIN_REG_FLASH_HOLD_IE_S)
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_IE_S  1
/** IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPU : R/W; bitpos: [2]; default: 0;
 *  flash hold wpu
 */
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPU    (BIT(2))
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPU_M  (IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPU_V << IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPU_S)
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPU_S  2
/** IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPD : R/W; bitpos: [3]; default: 0;
 *  flash hold wpd
 */
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPD    (BIT(3))
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPD_M  (IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPD_V << IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPD_S)
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_WPD_S  3
/** IOMUX_MSPI_PIN_REG_FLASH_HOLD_DRV : R/W; bitpos: [5:4]; default: 0;
 *  flash hold drv
 */
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_DRV_M  (IOMUX_MSPI_PIN_REG_FLASH_HOLD_DRV_V << IOMUX_MSPI_PIN_REG_FLASH_HOLD_DRV_S)
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_FLASH_HOLD_DRV_S  4

/** IOMUX_MSPI_PIN_FLASH_CK_PIN0_REG register
 *  IOMUX_MSPI_PIN_FLASH_CK_PIN0_REG
 */
#define IOMUX_MSPI_PIN_FLASH_CK_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x14)
/** IOMUX_MSPI_PIN_REG_FLASH_CK_HYS : R/W; bitpos: [0]; default: 0;
 *  flash ck hys
 */
#define IOMUX_MSPI_PIN_REG_FLASH_CK_HYS    (BIT(0))
#define IOMUX_MSPI_PIN_REG_FLASH_CK_HYS_M  (IOMUX_MSPI_PIN_REG_FLASH_CK_HYS_V << IOMUX_MSPI_PIN_REG_FLASH_CK_HYS_S)
#define IOMUX_MSPI_PIN_REG_FLASH_CK_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_CK_HYS_S  0
/** IOMUX_MSPI_PIN_REG_FLASH_CK_IE : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_FLASH_CK_IE    (BIT(1))
#define IOMUX_MSPI_PIN_REG_FLASH_CK_IE_M  (IOMUX_MSPI_PIN_REG_FLASH_CK_IE_V << IOMUX_MSPI_PIN_REG_FLASH_CK_IE_S)
#define IOMUX_MSPI_PIN_REG_FLASH_CK_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_CK_IE_S  1
/** IOMUX_MSPI_PIN_REG_FLASH_CK_WPU : R/W; bitpos: [2]; default: 0;
 *  flash ck wpu
 */
#define IOMUX_MSPI_PIN_REG_FLASH_CK_WPU    (BIT(2))
#define IOMUX_MSPI_PIN_REG_FLASH_CK_WPU_M  (IOMUX_MSPI_PIN_REG_FLASH_CK_WPU_V << IOMUX_MSPI_PIN_REG_FLASH_CK_WPU_S)
#define IOMUX_MSPI_PIN_REG_FLASH_CK_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_CK_WPU_S  2
/** IOMUX_MSPI_PIN_REG_FLASH_CK_WPD : R/W; bitpos: [3]; default: 0;
 *  flash ck wpd
 */
#define IOMUX_MSPI_PIN_REG_FLASH_CK_WPD    (BIT(3))
#define IOMUX_MSPI_PIN_REG_FLASH_CK_WPD_M  (IOMUX_MSPI_PIN_REG_FLASH_CK_WPD_V << IOMUX_MSPI_PIN_REG_FLASH_CK_WPD_S)
#define IOMUX_MSPI_PIN_REG_FLASH_CK_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_CK_WPD_S  3
/** IOMUX_MSPI_PIN_REG_FLASH_CK_DRV : R/W; bitpos: [5:4]; default: 0;
 *  flash ck drv
 */
#define IOMUX_MSPI_PIN_REG_FLASH_CK_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_FLASH_CK_DRV_M  (IOMUX_MSPI_PIN_REG_FLASH_CK_DRV_V << IOMUX_MSPI_PIN_REG_FLASH_CK_DRV_S)
#define IOMUX_MSPI_PIN_REG_FLASH_CK_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_FLASH_CK_DRV_S  4

/** IOMUX_MSPI_PIN_FLASH_D_PIN0_REG register
 *  IOMUX_MSPI_PIN_FLASH_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_FLASH_D_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x18)
/** IOMUX_MSPI_PIN_REG_FLASH_D_HYS : R/W; bitpos: [0]; default: 0;
 *  flash d hys
 */
#define IOMUX_MSPI_PIN_REG_FLASH_D_HYS    (BIT(0))
#define IOMUX_MSPI_PIN_REG_FLASH_D_HYS_M  (IOMUX_MSPI_PIN_REG_FLASH_D_HYS_V << IOMUX_MSPI_PIN_REG_FLASH_D_HYS_S)
#define IOMUX_MSPI_PIN_REG_FLASH_D_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_D_HYS_S  0
/** IOMUX_MSPI_PIN_REG_FLASH_D_IE : R/W; bitpos: [1]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_FLASH_D_IE    (BIT(1))
#define IOMUX_MSPI_PIN_REG_FLASH_D_IE_M  (IOMUX_MSPI_PIN_REG_FLASH_D_IE_V << IOMUX_MSPI_PIN_REG_FLASH_D_IE_S)
#define IOMUX_MSPI_PIN_REG_FLASH_D_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_D_IE_S  1
/** IOMUX_MSPI_PIN_REG_FLASH_D_WPU : R/W; bitpos: [2]; default: 0;
 *  flash d wpu
 */
#define IOMUX_MSPI_PIN_REG_FLASH_D_WPU    (BIT(2))
#define IOMUX_MSPI_PIN_REG_FLASH_D_WPU_M  (IOMUX_MSPI_PIN_REG_FLASH_D_WPU_V << IOMUX_MSPI_PIN_REG_FLASH_D_WPU_S)
#define IOMUX_MSPI_PIN_REG_FLASH_D_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_D_WPU_S  2
/** IOMUX_MSPI_PIN_REG_FLASH_D_WPD : R/W; bitpos: [3]; default: 0;
 *  flash d wpd
 */
#define IOMUX_MSPI_PIN_REG_FLASH_D_WPD    (BIT(3))
#define IOMUX_MSPI_PIN_REG_FLASH_D_WPD_M  (IOMUX_MSPI_PIN_REG_FLASH_D_WPD_V << IOMUX_MSPI_PIN_REG_FLASH_D_WPD_S)
#define IOMUX_MSPI_PIN_REG_FLASH_D_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_FLASH_D_WPD_S  3
/** IOMUX_MSPI_PIN_REG_FLASH_D_DRV : R/W; bitpos: [5:4]; default: 0;
 *  flash d drv
 */
#define IOMUX_MSPI_PIN_REG_FLASH_D_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_FLASH_D_DRV_M  (IOMUX_MSPI_PIN_REG_FLASH_D_DRV_V << IOMUX_MSPI_PIN_REG_FLASH_D_DRV_S)
#define IOMUX_MSPI_PIN_REG_FLASH_D_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_FLASH_D_DRV_S  4

/** IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG register
 *  IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x1c)
/** IOMUX_MSPI_PIN_REG_PSRAM_D_DLI : R/W; bitpos: [3:0]; default: 0;
 *  psram d dli
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_D_DLI    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_D_DLI_M  (IOMUX_MSPI_PIN_REG_PSRAM_D_DLI_V << IOMUX_MSPI_PIN_REG_PSRAM_D_DLI_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_D_DLI_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_D_DLI_S  0
/** IOMUX_MSPI_PIN_REG_PSRAM_D_DLC : R/W; bitpos: [7:4]; default: 0;
 *  psram d dlc
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_D_DLC    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_D_DLC_M  (IOMUX_MSPI_PIN_REG_PSRAM_D_DLC_V << IOMUX_MSPI_PIN_REG_PSRAM_D_DLC_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_D_DLC_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_D_DLC_S  4
/** IOMUX_MSPI_PIN_REG_PSRAM_D_HYS : R/W; bitpos: [8]; default: 0;
 *  psram d hys
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_D_HYS    (BIT(8))
#define IOMUX_MSPI_PIN_REG_PSRAM_D_HYS_M  (IOMUX_MSPI_PIN_REG_PSRAM_D_HYS_V << IOMUX_MSPI_PIN_REG_PSRAM_D_HYS_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_D_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_D_HYS_S  8
/** IOMUX_MSPI_PIN_REG_PSRAM_D_IE : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_D_IE    (BIT(9))
#define IOMUX_MSPI_PIN_REG_PSRAM_D_IE_M  (IOMUX_MSPI_PIN_REG_PSRAM_D_IE_V << IOMUX_MSPI_PIN_REG_PSRAM_D_IE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_D_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_D_IE_S  9
/** IOMUX_MSPI_PIN_REG_PSRAM_D_WPU : R/W; bitpos: [10]; default: 0;
 *  psram d wpu
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_D_WPU    (BIT(10))
#define IOMUX_MSPI_PIN_REG_PSRAM_D_WPU_M  (IOMUX_MSPI_PIN_REG_PSRAM_D_WPU_V << IOMUX_MSPI_PIN_REG_PSRAM_D_WPU_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_D_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_D_WPU_S  10
/** IOMUX_MSPI_PIN_REG_PSRAM_D_WPD : R/W; bitpos: [11]; default: 0;
 *  psram d wpd
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_D_WPD    (BIT(11))
#define IOMUX_MSPI_PIN_REG_PSRAM_D_WPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_D_WPD_V << IOMUX_MSPI_PIN_REG_PSRAM_D_WPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_D_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_D_WPD_S  11
/** IOMUX_MSPI_PIN_REG_PSRAM_D_DRV : R/W; bitpos: [13:12]; default: 0;
 *  psram d drv
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_D_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_D_DRV_M  (IOMUX_MSPI_PIN_REG_PSRAM_D_DRV_V << IOMUX_MSPI_PIN_REG_PSRAM_D_DRV_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_D_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_D_DRV_S  12

/** IOMUX_MSPI_PIN_PSRAM_Q_PIN0_REG register
 *  IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_PSRAM_Q_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x20)
/** IOMUX_MSPI_PIN_REG_PSRAM_Q_DLI : R/W; bitpos: [3:0]; default: 0;
 *  psram q dli
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_DLI    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_DLI_M  (IOMUX_MSPI_PIN_REG_PSRAM_Q_DLI_V << IOMUX_MSPI_PIN_REG_PSRAM_Q_DLI_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_DLI_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_DLI_S  0
/** IOMUX_MSPI_PIN_REG_PSRAM_Q_DLC : R/W; bitpos: [7:4]; default: 0;
 *  psram q dlc
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_DLC    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_DLC_M  (IOMUX_MSPI_PIN_REG_PSRAM_Q_DLC_V << IOMUX_MSPI_PIN_REG_PSRAM_Q_DLC_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_DLC_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_DLC_S  4
/** IOMUX_MSPI_PIN_REG_PSRAM_Q_HYS : R/W; bitpos: [8]; default: 0;
 *  psram q hys
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_HYS    (BIT(8))
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_HYS_M  (IOMUX_MSPI_PIN_REG_PSRAM_Q_HYS_V << IOMUX_MSPI_PIN_REG_PSRAM_Q_HYS_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_HYS_S  8
/** IOMUX_MSPI_PIN_REG_PSRAM_Q_IE : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_IE    (BIT(9))
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_IE_M  (IOMUX_MSPI_PIN_REG_PSRAM_Q_IE_V << IOMUX_MSPI_PIN_REG_PSRAM_Q_IE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_IE_S  9
/** IOMUX_MSPI_PIN_REG_PSRAM_Q_WPU : R/W; bitpos: [10]; default: 0;
 *  psram q wpu
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_WPU    (BIT(10))
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_WPU_M  (IOMUX_MSPI_PIN_REG_PSRAM_Q_WPU_V << IOMUX_MSPI_PIN_REG_PSRAM_Q_WPU_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_WPU_S  10
/** IOMUX_MSPI_PIN_REG_PSRAM_Q_WPD : R/W; bitpos: [11]; default: 0;
 *  psram q wpd
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_WPD    (BIT(11))
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_WPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_Q_WPD_V << IOMUX_MSPI_PIN_REG_PSRAM_Q_WPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_WPD_S  11
/** IOMUX_MSPI_PIN_REG_PSRAM_Q_DRV : R/W; bitpos: [13:12]; default: 0;
 *  psram q drv
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_DRV_M  (IOMUX_MSPI_PIN_REG_PSRAM_Q_DRV_V << IOMUX_MSPI_PIN_REG_PSRAM_Q_DRV_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_Q_DRV_S  12

