espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/iomux_mspi_pin_reg.h
/** IOMUX_MSPI_PIN_PSRAM_CS_PIN0_REG register
 *  IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_PSRAM_CS_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x44)
/** IOMUX_MSPI_PIN_REG_PSRAM_CS_DLI : R/W; bitpos: [3:0]; default: 0;
 *  psram cs dli
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_DLI    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_DLI_M  (IOMUX_MSPI_PIN_REG_PSRAM_CS_DLI_V << IOMUX_MSPI_PIN_REG_PSRAM_CS_DLI_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_DLI_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_DLI_S  0
/** IOMUX_MSPI_PIN_REG_PSRAM_CS_DLC : R/W; bitpos: [7:4]; default: 0;
 *  psram cs dlc
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_DLC    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_DLC_M  (IOMUX_MSPI_PIN_REG_PSRAM_CS_DLC_V << IOMUX_MSPI_PIN_REG_PSRAM_CS_DLC_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_DLC_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_DLC_S  4
/** IOMUX_MSPI_PIN_REG_PSRAM_CS_HYS : R/W; bitpos: [8]; default: 0;
 *  psram cs hys
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_HYS    (BIT(8))
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_HYS_M  (IOMUX_MSPI_PIN_REG_PSRAM_CS_HYS_V << IOMUX_MSPI_PIN_REG_PSRAM_CS_HYS_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_HYS_S  8
/** IOMUX_MSPI_PIN_REG_PSRAM_CS_IE : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_IE    (BIT(9))
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_IE_M  (IOMUX_MSPI_PIN_REG_PSRAM_CS_IE_V << IOMUX_MSPI_PIN_REG_PSRAM_CS_IE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_IE_S  9
/** IOMUX_MSPI_PIN_REG_PSRAM_CS_WPU : R/W; bitpos: [10]; default: 0;
 *  psram cs wpu
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_WPU    (BIT(10))
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_WPU_M  (IOMUX_MSPI_PIN_REG_PSRAM_CS_WPU_V << IOMUX_MSPI_PIN_REG_PSRAM_CS_WPU_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_WPU_S  10
/** IOMUX_MSPI_PIN_REG_PSRAM_CS_WPD : R/W; bitpos: [11]; default: 0;
 *  psram cs wpd
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_WPD    (BIT(11))
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_WPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_CS_WPD_V << IOMUX_MSPI_PIN_REG_PSRAM_CS_WPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_WPD_S  11
/** IOMUX_MSPI_PIN_REG_PSRAM_CS_DRV : R/W; bitpos: [13:12]; default: 0;
 *  psram cs drv
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_DRV_M  (IOMUX_MSPI_PIN_REG_PSRAM_CS_DRV_V << IOMUX_MSPI_PIN_REG_PSRAM_CS_DRV_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_CS_DRV_S  12

/** IOMUX_MSPI_PIN_PSRAM_DQ8_PIN0_REG register
 *  IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_PSRAM_DQ8_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x48)
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLI : R/W; bitpos: [3:0]; default: 0;
 *  psram dq8 dli
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLI    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLI_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLI_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLI_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLI_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLI_S  0
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLC : R/W; bitpos: [7:4]; default: 0;
 *  psram dq8 dlc
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLC    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLC_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLC_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLC_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLC_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DLC_S  4
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ8_HYS : R/W; bitpos: [8]; default: 0;
 *  psram dq8 hys
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_HYS    (BIT(8))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_HYS_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ8_HYS_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ8_HYS_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_HYS_S  8
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ8_IE : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_IE    (BIT(9))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_IE_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ8_IE_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ8_IE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_IE_S  9
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPU : R/W; bitpos: [10]; default: 0;
 *  psram dq8 wpu
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPU    (BIT(10))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPU_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPU_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPU_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPU_S  10
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPD : R/W; bitpos: [11]; default: 0;
 *  psram dq8 wpd
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPD    (BIT(11))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPD_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_WPD_S  11
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DRV : R/W; bitpos: [13:12]; default: 0;
 *  psram dq8 drv
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DRV_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DRV_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DRV_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ8_DRV_S  12

/** IOMUX_MSPI_PIN_PSRAM_DQ9_PIN0_REG register
 *  IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_PSRAM_DQ9_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x4c)
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLI : R/W; bitpos: [3:0]; default: 0;
 *  psram dq9 dli
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLI    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLI_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLI_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLI_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLI_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLI_S  0
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLC : R/W; bitpos: [7:4]; default: 0;
 *  psram dq9 dlc
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLC    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLC_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLC_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLC_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLC_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DLC_S  4
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ9_HYS : R/W; bitpos: [8]; default: 0;
 *  psram dq9 hys
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_HYS    (BIT(8))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_HYS_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ9_HYS_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ9_HYS_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_HYS_S  8
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ9_IE : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_IE    (BIT(9))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_IE_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ9_IE_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ9_IE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_IE_S  9
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPU : R/W; bitpos: [10]; default: 0;
 *  psram dq9 wpu
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPU    (BIT(10))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPU_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPU_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPU_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPU_S  10
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPD : R/W; bitpos: [11]; default: 0;
 *  psram dq9 wpd
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPD    (BIT(11))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPD_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_WPD_S  11
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DRV : R/W; bitpos: [13:12]; default: 0;
 *  psram dq9 drv
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DRV_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DRV_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DRV_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ9_DRV_S  12

