espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/iomux_mspi_pin_reg.h
/** IOMUX_MSPI_PIN_PSRAM_DQ10_PIN0_REG register
 *  IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_PSRAM_DQ10_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x50)
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLI : R/W; bitpos: [3:0]; default: 0;
 *  psram dq10 dli
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLI    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLI_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLI_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLI_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLI_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLI_S  0
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLC : R/W; bitpos: [7:4]; default: 0;
 *  psram dq10 dlc
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLC    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLC_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLC_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLC_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLC_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DLC_S  4
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ10_HYS : R/W; bitpos: [8]; default: 0;
 *  psram dq10 hys
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_HYS    (BIT(8))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_HYS_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ10_HYS_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ10_HYS_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_HYS_S  8
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ10_IE : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_IE    (BIT(9))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_IE_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ10_IE_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ10_IE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_IE_S  9
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPU : R/W; bitpos: [10]; default: 0;
 *  psram dq10 wpu
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPU    (BIT(10))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPU_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPU_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPU_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPU_S  10
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPD : R/W; bitpos: [11]; default: 0;
 *  psram dq10 wpd
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPD    (BIT(11))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPD_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_WPD_S  11
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DRV : R/W; bitpos: [13:12]; default: 0;
 *  psram dq10 drv
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DRV_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DRV_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DRV_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ10_DRV_S  12

/** IOMUX_MSPI_PIN_PSRAM_DQ11_PIN0_REG register
 *  IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_PSRAM_DQ11_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x54)
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLI : R/W; bitpos: [3:0]; default: 0;
 *  psram dq11 dli
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLI    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLI_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLI_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLI_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLI_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLI_S  0
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLC : R/W; bitpos: [7:4]; default: 0;
 *  psram dq11 dlc
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLC    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLC_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLC_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLC_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLC_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DLC_S  4
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ11_HYS : R/W; bitpos: [8]; default: 0;
 *  psram dq11 hys
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_HYS    (BIT(8))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_HYS_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ11_HYS_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ11_HYS_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_HYS_S  8
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ11_IE : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_IE    (BIT(9))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_IE_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ11_IE_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ11_IE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_IE_S  9
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPU : R/W; bitpos: [10]; default: 0;
 *  psram dq11 wpu
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPU    (BIT(10))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPU_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPU_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPU_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPU_S  10
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPD : R/W; bitpos: [11]; default: 0;
 *  psram dq11 wpd
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPD    (BIT(11))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPD_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_WPD_S  11
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DRV : R/W; bitpos: [13:12]; default: 0;
 *  psram dq11 drv
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DRV_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DRV_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DRV_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ11_DRV_S  12

/** IOMUX_MSPI_PIN_PSRAM_DQ12_PIN0_REG register
 *  IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_PSRAM_DQ12_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x58)
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLI : R/W; bitpos: [3:0]; default: 0;
 *  psram dq12 dli
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLI    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLI_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLI_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLI_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLI_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLI_S  0
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLC : R/W; bitpos: [7:4]; default: 0;
 *  psram dq12 dlc
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLC    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLC_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLC_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLC_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLC_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DLC_S  4
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ12_HYS : R/W; bitpos: [8]; default: 0;
 *  psram dq12 hys
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_HYS    (BIT(8))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_HYS_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ12_HYS_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ12_HYS_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_HYS_S  8
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ12_IE : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_IE    (BIT(9))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_IE_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ12_IE_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ12_IE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_IE_S  9
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPU : R/W; bitpos: [10]; default: 0;
 *  psram dq12 wpu
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPU    (BIT(10))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPU_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPU_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPU_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPU_S  10
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPD : R/W; bitpos: [11]; default: 0;
 *  psram dq12 wpd
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPD    (BIT(11))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPD_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_WPD_S  11
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DRV : R/W; bitpos: [13:12]; default: 0;
 *  psram dq12 drv
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DRV_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DRV_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DRV_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ12_DRV_S  12

/** IOMUX_MSPI_PIN_PSRAM_DQ13_PIN0_REG register
 *  IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_PSRAM_DQ13_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x5c)
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLI : R/W; bitpos: [3:0]; default: 0;
 *  psram dq13 dli
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLI    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLI_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLI_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLI_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLI_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLI_S  0
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLC : R/W; bitpos: [7:4]; default: 0;
 *  psram dq13 dlc
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLC    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLC_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLC_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLC_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLC_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DLC_S  4
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ13_HYS : R/W; bitpos: [8]; default: 0;
 *  psram dq13 hys
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_HYS    (BIT(8))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_HYS_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ13_HYS_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ13_HYS_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_HYS_S  8
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ13_IE : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_IE    (BIT(9))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_IE_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ13_IE_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ13_IE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_IE_S  9
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPU : R/W; bitpos: [10]; default: 0;
 *  psram dq13 wpu
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPU    (BIT(10))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPU_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPU_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPU_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPU_S  10
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPD : R/W; bitpos: [11]; default: 0;
 *  psram dq13 wpd
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPD    (BIT(11))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPD_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_WPD_S  11
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DRV : R/W; bitpos: [13:12]; default: 0;
 *  psram dq13 drv
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DRV_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DRV_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DRV_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ13_DRV_S  12

/** IOMUX_MSPI_PIN_PSRAM_DQ14_PIN0_REG register
 *  IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_PSRAM_DQ14_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x60)
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLI : R/W; bitpos: [3:0]; default: 0;
 *  psram dq14 dli
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLI    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLI_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLI_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLI_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLI_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLI_S  0
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLC : R/W; bitpos: [7:4]; default: 0;
 *  psram dq14 dlc
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLC    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLC_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLC_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLC_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLC_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DLC_S  4
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ14_HYS : R/W; bitpos: [8]; default: 0;
 *  psram dq14 hys
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_HYS    (BIT(8))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_HYS_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ14_HYS_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ14_HYS_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_HYS_S  8
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ14_IE : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_IE    (BIT(9))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_IE_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ14_IE_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ14_IE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_IE_S  9
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPU : R/W; bitpos: [10]; default: 0;
 *  psram dq14 wpu
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPU    (BIT(10))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPU_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPU_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPU_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPU_S  10
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPD : R/W; bitpos: [11]; default: 0;
 *  psram dq14 wpd
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPD    (BIT(11))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPD_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_WPD_S  11
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DRV : R/W; bitpos: [13:12]; default: 0;
 *  psram dq14 drv
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DRV_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DRV_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DRV_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ14_DRV_S  12

/** IOMUX_MSPI_PIN_PSRAM_DQ15_PIN0_REG register
 *  IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_PSRAM_DQ15_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x64)
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLI : R/W; bitpos: [3:0]; default: 0;
 *  psram dq15 dli
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLI    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLI_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLI_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLI_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLI_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLI_S  0
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLC : R/W; bitpos: [7:4]; default: 0;
 *  psram dq15 dlc
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLC    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLC_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLC_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLC_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLC_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DLC_S  4
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ15_HYS : R/W; bitpos: [8]; default: 0;
 *  psram dq15 hys
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_HYS    (BIT(8))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_HYS_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ15_HYS_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ15_HYS_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_HYS_S  8
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ15_IE : R/W; bitpos: [9]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_IE    (BIT(9))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_IE_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ15_IE_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ15_IE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_IE_S  9
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPU : R/W; bitpos: [10]; default: 0;
 *  psram dq15 wpu
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPU    (BIT(10))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPU_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPU_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPU_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPU_S  10
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPD : R/W; bitpos: [11]; default: 0;
 *  psram dq15 wpd
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPD    (BIT(11))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPD_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_WPD_S  11
/** IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DRV : R/W; bitpos: [13:12]; default: 0;
 *  psram dq15 drv
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DRV_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DRV_V << IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DRV_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQ15_DRV_S  12

/** IOMUX_MSPI_PIN_PSRAM_DQS_1_PIN0_REG register
 *  IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG
 */
#define IOMUX_MSPI_PIN_PSRAM_DQS_1_PIN0_REG (DR_REG_IOMUX_MSPI_PIN_BASE + 0x68)
/** IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_XPD : R/W; bitpos: [0]; default: 0;
 *  psram xpd dqs1
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_XPD    (BIT(0))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_XPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_XPD_V << IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_XPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_XPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_XPD_S  0
/** IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_PHASE : R/W; bitpos: [2:1]; default: 0;
 *  psram dqs1 phase
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_PHASE    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_PHASE_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_PHASE_V << IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_PHASE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_PHASE_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_PHASE_S  1
/** IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DLI : R/W; bitpos: [6:3]; default: 0;
 *  psram dqs1 dli
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DLI    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DLI_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DLI_V << IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DLI_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DLI_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DLI_S  3
/** IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_90 : R/W; bitpos: [10:7]; default: 0;
 *  psram dqs1 delay 90
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_90    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_90_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_90_V << IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_90_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_90_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_90_S  7
/** IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_HYS : R/W; bitpos: [11]; default: 0;
 *  psram dqs1 hys
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_HYS    (BIT(11))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_HYS_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_HYS_V << IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_HYS_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_HYS_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_HYS_S  11
/** IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_IE : R/W; bitpos: [12]; default: 0;
 *  Reserved
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_IE    (BIT(12))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_IE_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_IE_V << IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_IE_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_IE_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_IE_S  12
/** IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPU : R/W; bitpos: [13]; default: 0;
 *  psram dqs1 wpu
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPU    (BIT(13))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPU_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPU_V << IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPU_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPU_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPU_S  13
/** IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPD : R/W; bitpos: [14]; default: 0;
 *  psram dqs1 wpd
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPD    (BIT(14))
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPD_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPD_V << IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPD_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPD_V  0x00000001U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_WPD_S  14
/** IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DRV : R/W; bitpos: [16:15]; default: 0;
 *  psram dqs1 drv
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DRV    0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DRV_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DRV_V << IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DRV_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DRV_V  0x00000003U
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DRV_S  15
/** IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_270 : R/W; bitpos: [20:17]; default: 0;
 *  psram dqs1 delay 270
 */
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_270    0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_270_M  (IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_270_V << IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_270_S)
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_270_V  0x0000000FU
#define IOMUX_MSPI_PIN_REG_PSRAM_DQS_1_DELAY_270_S  17

#ifdef __cplusplus
}
#endif
